# 01.1 Weather

In this notebook, the weather dataframe is created.

In [1]:
## Import libraries
## Until WS05
import numpy as np
import pandas as pd
import datetime

## Visualization
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns

## For saving files
from pathlib import Path

## Kaggle (OpenWeather) Datasets

The data was originally procured from https://openweathermap.org/ 

Overview of the units for the city of Chicago:
https://openweathermap.org/city/4887398

### Temperature

Originally, the temperature is given in degree Kelvin.

In [2]:
df_temp = pd.read_csv("temperature.csv", parse_dates=['datetime'])
df_temp.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,309.100000,NaN,NaN,NaN
1,2012-10-01 13:00:00,284.630000,282.080000,289.480000,281.800000,291.870000,291.530000,293.410000,296.600000,285.120000,...,285.630000,288.220000,285.830000,287.170000,307.590000,305.470000,310.580000,304.4,304.4,303.5
2,2012-10-01 14:00:00,284.629041,282.083252,289.474993,281.797217,291.868186,291.533501,293.403141,296.608509,285.154558,...,285.663208,288.247676,285.834650,287.186092,307.590000,304.310000,310.495769,304.4,304.4,303.5
3,2012-10-01 15:00:00,284.626998,282.091866,289.460618,281.789833,291.862844,291.543355,293.392177,296.631487,285.233952,...,285.756824,288.326940,285.847790,287.231672,307.391513,304.281841,310.411538,304.4,304.4,303.5
4,2012-10-01 16:00:00,284.624955,282.100481,289.446243,281.782449,291.857503,291.553209,293.381213,296.654466,285.313345,...,285.850440,288.406203,285.860929,287.277251,307.145200,304.238015,310.327308,304.4,304.4,303.5

In [3]:
## Drop superfluous cities
df_temp.drop(df_temp.columns.difference(['datetime','Chicago']), axis=1, inplace=True)

## Drop superfluous weather data
d1 = datetime.datetime(2013, 1, 1)
d2 = datetime.datetime(2014, 1, 1)
df_temp = df_temp[df_temp.datetime >= d1]
df_temp = df_temp[df_temp.datetime < d2]

## Add unique index to weather
df_temp['index'] = range(0, len(df_temp))
df_temp = df_temp.set_index('index')

## Rename column Chicago
df_temp.rename(columns={"Chicago": "temperature"}, inplace = True)
## Convert from Kelvin to Celsius
df_temp['temperature'] = df_temp['temperature'] - 273.15 
df_temp

                 datetime  temperature
index
0     2013-01-01 00:00:00        -0.19
1     2013-01-01 01:00:00         0.28
2     2013-01-01 02:00:00         0.33
3     2013-01-01 03:00:00         0.12
4     2013-01-01 04:00:00         0.04
...                   ...          ...
8755  2013-12-31 19:00:00       -11.27
8756  2013-12-31 20:00:00       -10.60
8757  2013-12-31 21:00:00       -10.98
8758  2013-12-31 22:00:00       -11.24
8759  2013-12-31 23:00:00       -11.00

[8760 rows x 2 columns]

In [4]:
df_temp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8760 entries, 0 to 8759
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   datetime     8760 non-null   datetime64[ns]
 1   temperature  8758 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 205.3 KB

We can see that there are two temperature values missing.

In [5]:
df_temp.describe()

       temperature
count  8758.000000
mean      9.942069
std      11.210484
min     -17.920000
25%       0.800000
50%      10.364167
75%      19.423000
max      35.330000

The temperatures seem to be consistent with what can be found about the weather (extremes) in Chicago: https://www.weather.gov/lot/Chicago_Temperature_Records

In [6]:
df_temp[df_temp['temperature'].isna()]

                 datetime  temperature
index
1663  2013-03-11 07:00:00          NaN
1664  2013-03-11 08:00:00          NaN

In [7]:
df_temp[df_temp['datetime'].isna()]

Empty DataFrame
Columns: [datetime, temperature]
Index: []

Coincidentally, the missing values are adjacent. Therefore, we have a look at the temperature before and after those missing values:

In [8]:
print(df_temp[df_temp['datetime']=='2013-03-11 06:00:00'])
print(df_temp[df_temp['datetime']=='2013-03-11 09:00:00'])

                 datetime  temperature
index
1662  2013-03-11 06:00:00         7.54
                 datetime  temperature
index
1665  2013-03-11 09:00:00          5.7

In [9]:
fill = (7.54 + 5.7) / 2
df_temp.at[1663,'temperature']= fill
df_temp.at[1664,'temperature']= fill
print(df_temp[df_temp['datetime']=='2013-03-11 07:00:00'])
print(df_temp[df_temp['datetime']=='2013-03-11 08:00:00'])

                 datetime  temperature
index
1663  2013-03-11 07:00:00         6.62
                 datetime  temperature
index
1664  2013-03-11 08:00:00         6.62

In [10]:
df_temp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8760 entries, 0 to 8759
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   datetime     8760 non-null   datetime64[ns]
 1   temperature  8760 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 463.4 KB

In [11]:
df_temp.duplicated(keep='first')

index
0       False
1       False
2       False
3       False
4       False
        ...
8755    False
8756    False
8757    False
8758    False
8759    False
Length: 8760, dtype: bool

We can see that there are no duplicates and no NaN values left.

### Weather Description

In [12]:
df_desc = pd.read_csv("weather_description.csv", parse_dates=['datetime'])
df_desc.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,haze,NaN,NaN,NaN
1,2012-10-01 13:00:00,mist,scattered clouds,light rain,sky is clear,mist,sky is clear,sky is clear,sky is clear,sky is clear,...,broken clouds,few clouds,overcast clouds,sky is clear,sky is clear,sky is clear,haze,sky is clear,sky is clear,sky is clear
2,2012-10-01 14:00:00,broken clouds,scattered clouds,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,...,broken clouds,few clouds,sky is clear,few clouds,sky is clear,sky is clear,broken clouds,overcast clouds,sky is clear,overcast clouds
3,2012-10-01 15:00:00,broken clouds,scattered clouds,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,...,broken clouds,few clouds,sky is clear,few clouds,overcast clouds,sky is clear,broken clouds,overcast clouds,overcast clouds,overcast clouds
4,2012-10-01 16:00:00,broken clouds,scattered clouds,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,...,broken clouds,few clouds,sky is clear,few clouds,overcast clouds,sky is clear,broken clouds,overcast clouds,overcast clouds,overcast clouds

In [13]:
## Drop superfluous cities
df_desc.drop(df_desc.columns.difference(['datetime','Chicago']), axis=1, inplace=True)

## Drop superfluous weather data
d1 = datetime.datetime(2013, 1, 1)
d2 = datetime.datetime(2014, 1, 1)
df_desc = df_desc[df_desc.datetime >= d1]
df_desc = df_desc[df_desc.datetime < d2]

## Add unique index to weather
df_desc['index'] = range(0, len(df_desc))
df_desc = df_desc.set_index('index')

## Rename column Chicago
df_desc.rename(columns={"Chicago": "weather_description"}, inplace = True)
df_desc

                 datetime weather_description
index
0     2013-01-01 00:00:00     overcast clouds
1     2013-01-01 01:00:00       broken clouds
2     2013-01-01 02:00:00     overcast clouds
3     2013-01-01 03:00:00     overcast clouds
4     2013-01-01 04:00:00       broken clouds
...                   ...                 ...
8755  2013-12-31 19:00:00       broken clouds
8756  2013-12-31 20:00:00       broken clouds
8757  2013-12-31 21:00:00          light snow
8758  2013-12-31 22:00:00                snow
8759  2013-12-31 23:00:00                mist

[8760 rows x 2 columns]

In [14]:
df_desc['weather_description'].value_counts()

sky is clear                    2139
broken clouds                   1908
overcast clouds                 1329
scattered clouds                 902
few clouds                       639
light rain                       625
mist                             572
moderate rain                    170
heavy snow                       142
haze                              72
light snow                        59
heavy intensity rain              57
fog                               33
thunderstorm with light rain      22
light intensity drizzle           19
proximity thunderstorm            18
very heavy rain                   13
thunderstorm                      13
thunderstorm with rain             9
snow                               7
thunderstorm with heavy rain       5
drizzle                            4
light rain and snow                2
heavy intensity drizzle            1
Name: weather_description, dtype: int64

In [15]:
df_desc.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8760 entries, 0 to 8759
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   datetime             8760 non-null   datetime64[ns]
 1   weather_description  8760 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 205.3+ KB

In [16]:
df_temp.duplicated(keep='first')

index
0       False
1       False
2       False
3       False
4       False
        ...
8755    False
8756    False
8757    False
8758    False
8759    False
Length: 8760, dtype: bool

In [17]:
df_desc[df_desc['weather_description'].isna()]

Empty DataFrame
Columns: [datetime, weather_description]
Index: []

In [18]:
df_desc[df_desc['datetime'].isna()]

Empty DataFrame
Columns: [datetime, weather_description]
Index: []

In [19]:
print(df_desc['weather_description'].unique())

['overcast clouds' 'broken clouds' 'sky is clear' 'scattered clouds'
 'few clouds' 'heavy snow' 'haze' 'mist' 'light rain'
 'light rain and snow' 'moderate rain' 'heavy intensity rain'
 'light intensity drizzle' 'fog' 'snow' 'light snow'
 'thunderstorm with rain' 'thunderstorm with light rain' 'drizzle'
 'proximity thunderstorm' 'thunderstorm with heavy rain' 'very heavy rain'
 'thunderstorm' 'heavy intensity drizzle']

We can see that there is a great variety of different weather descriptions. To quantify the descriptions, we reduce them to precipitation or no precipitation.

In [20]:
## Distinuish between precipitation and no precip,(( we consider fog and mist as precip 
## because they are similar to / include light rain ))

df_desc.loc[(df_desc['weather_description'] == 'scattered clouds')
            |(df_desc['weather_description'] == 'sky is clear')
            |(df_desc['weather_description'] == 'overcast clouds')
            |(df_desc['weather_description'] == 'broken clouds')
            |(df_desc['weather_description'] == 'few clouds')
            |(df_desc['weather_description'] == 'fog')
            |(df_desc['weather_description'] == 'mist')
            |(df_desc['weather_description'] == 'haze'), 'weather_description'] = 0
df_desc.loc[(df_desc['weather_description'] != 0), 'weather_description'] = 1
df_desc

                 datetime weather_description
index
0     2013-01-01 00:00:00                   0
1     2013-01-01 01:00:00                   0
2     2013-01-01 02:00:00                   0
3     2013-01-01 03:00:00                   0
4     2013-01-01 04:00:00                   0
...                   ...                 ...
8755  2013-12-31 19:00:00                   0
8756  2013-12-31 20:00:00                   0
8757  2013-12-31 21:00:00                   1
8758  2013-12-31 22:00:00                   1
8759  2013-12-31 23:00:00                   0

[8760 rows x 2 columns]

In [21]:
## Rename column weather_description to precip(itation)
df_desc.rename(columns={"weather_description": "precip"}, inplace = True)
df_desc.nunique()

datetime    8760
precip         2
dtype: int64

In [22]:
df_desc['precip'].value_counts()

0    7594
1    1166
Name: precip, dtype: int64

### Humidity

The humidity is given in percent.

In [23]:
df_humid = pd.read_csv("humidity.csv", parse_dates=['datetime'])
df_humid.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,25.0,NaN,NaN,NaN
1,2012-10-01 13:00:00,76.0,81.0,88.0,81.0,88.0,82.0,22.0,23.0,50.0,...,71.0,58.0,93.0,68.0,50.0,63.0,22.0,51.0,51.0,50.0
2,2012-10-01 14:00:00,76.0,80.0,87.0,80.0,88.0,81.0,21.0,23.0,49.0,...,70.0,57.0,91.0,68.0,51.0,62.0,22.0,51.0,51.0,50.0
3,2012-10-01 15:00:00,76.0,80.0,86.0,80.0,88.0,81.0,21.0,23.0,49.0,...,70.0,57.0,87.0,68.0,51.0,62.0,22.0,51.0,51.0,50.0
4,2012-10-01 16:00:00,77.0,80.0,85.0,79.0,88.0,81.0,21.0,23.0,49.0,...,69.0,57.0,84.0,68.0,52.0,62.0,22.0,51.0,51.0,50.0

In [24]:
## Drop superfluous cities
df_humid.drop(df_humid.columns.difference(['datetime','Chicago']), axis=1, inplace=True)

## Drop superfluous weather data
d1 = datetime.datetime(2013, 1, 1)
d2 = datetime.datetime(2014, 1, 1)
df_humid = df_humid[df_humid.datetime >= d1]
df_humid = df_humid[df_humid.datetime < d2]

## Add unique index to weather
df_humid['index'] = range(0, len(df_humid))
df_humid = df_humid.set_index('index')

## Rename column Chicago
df_humid.rename(columns={"Chicago": "humidity"}, inplace = True)
df_humid

                 datetime  humidity
index
0     2013-01-01 00:00:00       NaN
1     2013-01-01 01:00:00      64.0
2     2013-01-01 02:00:00      69.0
3     2013-01-01 03:00:00       NaN
4     2013-01-01 04:00:00      68.0
...                   ...       ...
8755  2013-12-31 19:00:00      89.0
8756  2013-12-31 20:00:00      89.0
8757  2013-12-31 21:00:00      89.0
8758  2013-12-31 22:00:00      89.0
8759  2013-12-31 23:00:00      89.0

[8760 rows x 2 columns]

In [25]:
df_desc.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8760 entries, 0 to 8759
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  8760 non-null   datetime64[ns]
 1   precip    8760 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 205.3+ KB

In [26]:
df_temp.duplicated(keep='first')

index
0       False
1       False
2       False
3       False
4       False
        ...
8755    False
8756    False
8757    False
8758    False
8759    False
Length: 8760, dtype: bool

In [27]:
df_humid[df_humid['humidity'].isna()]

                 datetime  humidity
index
0     2013-01-01 00:00:00       NaN
3     2013-01-01 03:00:00       NaN
6     2013-01-01 06:00:00       NaN
8     2013-01-01 08:00:00       NaN
9     2013-01-01 09:00:00       NaN
...                   ...       ...
3725  2013-06-05 05:00:00       NaN
3727  2013-06-05 07:00:00       NaN
3729  2013-06-05 09:00:00       NaN
3730  2013-06-05 10:00:00       NaN
8013  2013-11-30 21:00:00       NaN

[628 rows x 2 columns]

In [28]:
df_humid[df_humid['datetime'].isna()]

Empty DataFrame
Columns: [datetime, humidity]
Index: []

In [29]:
df_humid['humidity'].describe()

count    8132.000000
mean       75.193925
std        16.704538
min        17.000000
25%        64.000000
50%        78.000000
75%        89.000000
max       100.000000
Name: humidity, dtype: float64

We carry out imputation using the overall mean humidity to replace the missing values.

In [30]:
df_humid = df_humid.fillna(df_humid['humidity'].mean())
df_humid.head()

                 datetime   humidity
index
0     2013-01-01 00:00:00  75.193925
1     2013-01-01 01:00:00  64.000000
2     2013-01-01 02:00:00  69.000000
3     2013-01-01 03:00:00  75.193925
4     2013-01-01 04:00:00  68.000000

### Pressure

The pressure is given in hPa (hectopascal).

In [31]:
df_press = pd.read_csv("pressure.csv", parse_dates=['datetime'])
df_press.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1011.0,NaN,NaN,NaN
1,2012-10-01 13:00:00,NaN,1024.0,1009.0,1027.0,1013.0,1013.0,1018.0,1013.0,1024.0,...,1014.0,1012.0,1001.0,1014.0,984.0,1012.0,1010.0,1013.0,1013.0,990.0
2,2012-10-01 14:00:00,NaN,1024.0,1009.0,1027.0,1013.0,1013.0,1018.0,1013.0,1024.0,...,1014.0,1012.0,986.0,1014.0,984.0,1012.0,1010.0,1013.0,1013.0,990.0
3,2012-10-01 15:00:00,NaN,1024.0,1009.0,1028.0,1013.0,1013.0,1018.0,1013.0,1024.0,...,1014.0,1012.0,945.0,1014.0,984.0,1012.0,1010.0,1013.0,1013.0,990.0
4,2012-10-01 16:00:00,NaN,1024.0,1009.0,1028.0,1013.0,1013.0,1018.0,1013.0,1024.0,...,1014.0,1012.0,904.0,1014.0,984.0,1012.0,1010.0,1013.0,1013.0,990.0

In [32]:
## Drop superfluous cities
df_press.drop(df_press.columns.difference(['datetime','Chicago']), axis=1, inplace=True)

## Drop superfluous weather data
d1 = datetime.datetime(2013, 1, 1)
d2 = datetime.datetime(2014, 1, 1)
df_press = df_press[df_press.datetime >= d1]
df_press = df_press[df_press.datetime < d2]

## Add unique index to weather
df_press['index'] = range(0, len(df_press))
df_press = df_press.set_index('index')

## Rename column Chicago
df_press.rename(columns={"Chicago": "pressure"}, inplace = True)
df_press

                 datetime  pressure
index
0     2013-01-01 00:00:00    1024.0
1     2013-01-01 01:00:00    1022.0
2     2013-01-01 02:00:00    1022.0
3     2013-01-01 03:00:00    1021.0
4     2013-01-01 04:00:00    1021.0
...                   ...       ...
8755  2013-12-31 19:00:00    1026.0
8756  2013-12-31 20:00:00    1026.0
8757  2013-12-31 21:00:00    1026.0
8758  2013-12-31 22:00:00    1026.0
8759  2013-12-31 23:00:00    1023.0

[8760 rows x 2 columns]

In [33]:
df_press.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8760 entries, 0 to 8759
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   datetime  8760 non-null   datetime64[ns]
 1   pressure  8203 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 205.3 KB

In [34]:
df_press.duplicated(keep='first')

index
0       False
1       False
2       False
3       False
4       False
        ...
8755    False
8756    False
8757    False
8758    False
8759    False
Length: 8760, dtype: bool

In [35]:
df_press[df_press['pressure'].isna()]

                 datetime  pressure
index
6     2013-01-01 06:00:00       NaN
71    2013-01-03 23:00:00       NaN
107   2013-01-05 11:00:00       NaN
108   2013-01-05 12:00:00       NaN
143   2013-01-06 23:00:00       NaN
...                   ...       ...
3722  2013-06-05 02:00:00       NaN
3725  2013-06-05 05:00:00       NaN
3727  2013-06-05 07:00:00       NaN
3729  2013-06-05 09:00:00       NaN
3730  2013-06-05 10:00:00       NaN

[557 rows x 2 columns]

In [36]:
df_press[df_press['datetime'].isna()]

Empty DataFrame
Columns: [datetime, pressure]
Index: []

In [37]:
df_press['pressure'].describe()

count    8203.000000
mean     1016.571864
std         8.615725
min       979.000000
25%      1011.000000
50%      1016.000000
75%      1022.000000
max      1047.000000
Name: pressure, dtype: float64

We carry out imputation using the overall mean humidity to replace the missing values.

In [38]:
df_press = df_press.fillna(df_press['pressure'].mean())
df_press.head(7)

                 datetime     pressure
index
0     2013-01-01 00:00:00  1024.000000
1     2013-01-01 01:00:00  1022.000000
2     2013-01-01 02:00:00  1022.000000
3     2013-01-01 03:00:00  1021.000000
4     2013-01-01 04:00:00  1021.000000
5     2013-01-01 05:00:00  1020.000000
6     2013-01-01 06:00:00  1016.571864

### Wind Speed

The wind speed is given in m/s (meters per second).

In [39]:
df_wind = pd.read_csv("wind_speed.csv", parse_dates=['datetime'])
df_wind.head(5)

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,8.0,NaN,NaN,NaN
1,2012-10-01 13:00:00,0.0,0.0,2.0,0.0,0.0,0.0,0.0,2.0,4.0,...,4.0,7.0,4.0,3.0,1.0,0.0,8.0,2.0,2.0,2.0
2,2012-10-01 14:00:00,0.0,0.0,2.0,0.0,0.0,0.0,0.0,2.0,4.0,...,4.0,7.0,4.0,3.0,3.0,0.0,8.0,2.0,2.0,2.0
3,2012-10-01 15:00:00,0.0,0.0,2.0,0.0,0.0,0.0,0.0,2.0,4.0,...,3.0,7.0,4.0,3.0,3.0,0.0,8.0,2.0,2.0,2.0
4,2012-10-01 16:00:00,0.0,0.0,2.0,0.0,0.0,0.0,0.0,2.0,4.0,...,3.0,7.0,4.0,3.0,3.0,0.0,8.0,2.0,2.0,2.0

In [40]:
## Drop superfluous cities
df_wind.drop(df_wind.columns.difference(['datetime','Chicago']), axis= 1, inplace=True)

## Drop superfluous weather data
d1 = datetime.datetime(2013, 1, 1)
d2 = datetime.datetime(2014, 1, 1)
df_wind = df_wind[df_wind.datetime >= d1]
df_wind = df_wind[df_wind.datetime < d2]

## Add unique index to weather
df_wind['index'] = range(0, len(df_wind))
df_wind = df_wind.set_index('index')

## Rename column Chicago
df_wind.rename(columns={"Chicago": "wind_speed"}, inplace = True)
df_wind

                 datetime  wind_speed
index
0     2013-01-01 00:00:00         4.0
1     2013-01-01 01:00:00         3.0
2     2013-01-01 02:00:00         6.0
3     2013-01-01 03:00:00         7.0
4     2013-01-01 04:00:00         7.0
...                   ...         ...
8755  2013-12-31 19:00:00         0.0
8756  2013-12-31 20:00:00         0.0
8757  2013-12-31 21:00:00         3.0
8758  2013-12-31 22:00:00         1.0
8759  2013-12-31 23:00:00         1.0

[8760 rows x 2 columns]

In [41]:
df_wind.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8760 entries, 0 to 8759
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    8760 non-null   datetime64[ns]
 1   wind_speed  8760 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 205.3 KB

In [42]:
df_wind.duplicated(keep='first')

index
0       False
1       False
2       False
3       False
4       False
        ...
8755    False
8756    False
8757    False
8758    False
8759    False
Length: 8760, dtype: bool

In [43]:
df_wind[df_wind['wind_speed'].isna()]

Empty DataFrame
Columns: [datetime, wind_speed]
Index: []

In [44]:
df_wind[df_wind['datetime'].isna()]

Empty DataFrame
Columns: [datetime, wind_speed]
Index: []

In [45]:
df_wind['wind_speed'].describe()

count    8760.000000
mean        3.066667
std         2.238570
min         0.000000
25%         1.000000
50%         3.000000
75%         4.000000
max        18.000000
Name: wind_speed, dtype: float64

In [46]:
df_wind

                 datetime  wind_speed
index
0     2013-01-01 00:00:00         4.0
1     2013-01-01 01:00:00         3.0
2     2013-01-01 02:00:00         6.0
3     2013-01-01 03:00:00         7.0
4     2013-01-01 04:00:00         7.0
...                   ...         ...
8755  2013-12-31 19:00:00         0.0
8756  2013-12-31 20:00:00         0.0
8757  2013-12-31 21:00:00         3.0
8758  2013-12-31 22:00:00         1.0
8759  2013-12-31 23:00:00         1.0

[8760 rows x 2 columns]

## Merge Kaggle Data

Now, we merge all the aforementioned dataframes using the datetime column.

In [47]:
df_merged = df_desc.merge(df_temp, left_on='datetime', right_on='datetime')
df_merged = df_merged.merge(df_humid, left_on='datetime', right_on='datetime')
df_merged = df_merged.merge(df_press, left_on='datetime', right_on='datetime')
df_merged = df_merged.merge(df_wind, left_on='datetime', right_on='datetime')
df_merged.head()

             datetime precip  temperature   humidity  pressure  wind_speed
0 2013-01-01 00:00:00      0        -0.19  75.193925    1024.0         4.0
1 2013-01-01 01:00:00      0         0.28  64.000000    1022.0         3.0
2 2013-01-01 02:00:00      0         0.33  69.000000    1022.0         6.0
3 2013-01-01 03:00:00      0         0.12  75.193925    1021.0         7.0
4 2013-01-01 04:00:00      0         0.04  68.000000    1021.0         7.0

In [48]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8760 entries, 0 to 8759
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   datetime     8760 non-null   datetime64[ns]
 1   precip       8760 non-null   object
 2   temperature  8760 non-null   float64
 3   humidity     8760 non-null   float64
 4   pressure     8760 non-null   float64
 5   wind_speed   8760 non-null   float64
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 479.1+ KB

In [49]:
df_merged.describe()

       temperature     humidity     pressure   wind_speed
count  8760.000000  8760.000000  8760.000000  8760.000000
mean      9.941311    75.193925  1016.571864     3.066667
std      11.209317    16.094563     8.337281     2.238570
min     -17.920000    17.000000   979.000000     0.000000
25%       0.800000    65.000000  1011.000000     1.000000
50%      10.361000    76.000000  1016.571864     3.000000
75%      19.423000    89.000000  1021.000000     4.000000
max      35.330000   100.000000  1047.000000    18.000000

In [65]:
## Save as pickle
import pickle

# Saving
pickle.dump(df_merged, open("weather.pkl","wb"))

In [66]:
df_weather = pickle.load(open("weather.pkl","rb"))
df_weather.head()

             datetime precip  temperature   humidity  pressure  wind_speed
0 2013-01-01 00:00:00      0        -0.19  75.193925    1024.0         4.0
1 2013-01-01 01:00:00      0         0.28  64.000000    1022.0         3.0
2 2013-01-01 02:00:00      0         0.33  69.000000    1022.0         6.0
3 2013-01-01 03:00:00      0         0.12  75.193925    1021.0         7.0
4 2013-01-01 04:00:00      0         0.04  68.000000    1021.0         7.0

In [67]:
df_weather.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8760 entries, 0 to 8759
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   datetime     8760 non-null   datetime64[ns]
 1   precip       8760 non-null   object
 2   temperature  8760 non-null   float64
 3   humidity     8760 non-null   float64
 4   pressure     8760 non-null   float64
 5   wind_speed   8760 non-null   float64
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 479.1+ KB

## Hourly Precipitation (Chicago Midway Airport)

We use the data measured at the Chicago Midway Airport (https://mesonet1.agron.iastate.edu/sites/site.php?network=NCDC81&station=USW00014819) because it is the weather station that is closest to the city center out of all weather stations in Chicago that offer weather data for the year 2013. It is also relatively close to the GPS coordinates for Chicago, as stated on https://www.kaggle.com/datasets/selfishgene/historical-hourly-weather-data?select=city_attributes.csv or on https://openweathermap.org/city/4887398 (search for Chicago), which is the source of the Kaggle data.

In [51]:
## Manually calculate linear distance

from math import sin, cos, sqrt, atan2, radians

# Approximate radius of earth in km
R = 6373.0

lat1 = radians(41.850029)
lon1 = radians(-87.650047)
lat2 = radians(41.78610)
lon2 = radians(-87.75220)

dlon = lon2 - lon1
dlat = lat2 - lat1

a = sin(dlat / 2)**2 + cos(lat1) * cos(lat2) * sin(dlon / 2)**2
c = 2 * atan2(sqrt(a), sqrt(1 - a))

distance = R * c

print("Distance between Chicago Midway Airport and OpenWeatherMap coordinates: ", distance, "km")

Distance between Chicago Midway Airport and OpenWeatherMap coordinates:  11.057646677522532 km

Source / Documentation:

https://www.ncei.noaa.gov/cdo-web/datasets/PRECIP_HLY/stations/COOP:111577/detail

In [52]:
df_precip = pd.read_csv('precipitation.csv', parse_dates=['DATE'])
df_precip

         STATION                       STATION_NAME                DATE   HPCP
0    COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-01-01 01:00:00   0.00
1    COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-01-10 22:00:00  10.16
2    COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-01-11 00:00:00   2.54
3    COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-01-11 02:00:00   2.54
4    COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-01-11 03:00:00   2.54
..           ...                                ...                 ...    ...
257  COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-12-21 18:00:00   2.54
258  COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-12-21 19:00:00   2.54
259  COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-12-21 21:00:00   2.54
260  COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-12-22 07:00:00   2.54
261  COOP:111577  CHICAGO MIDWAY AIRPORT 3 SW IL US 2013-12-25 22:00:00   2.54

[262 rows x 4 columns]

HPCP: The amount of precipitation recorded at the station for the hour ending at the
time specified for DATE above given in hundredths of inches or tenths of millimeters
depending on user’s specification of standard or metric units. The values 99999 means
the data value is missing. Hours with no precipitation are not shown.

In [53]:
df_precip.describe()

               HPCP
count    262.000000
mean     197.691527
std     2214.600150
min        0.000000
25%        2.540000
50%        2.540000
75%        5.080000
max    25399.750000

In [54]:
df_precip.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 262 entries, 0 to 261
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   STATION       262 non-null    object
 1   STATION_NAME  262 non-null    object
 2   DATE          262 non-null    datetime64[ns]
 3   HPCP          262 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 8.3+ KB

## Daily Weather (Chicago Midway Airport)

GET request: 

https://www.ncei.noaa.gov/access/services/data/v1?dataset=daily-summaries&stations=USW00014819&startDate=2013-01-01&endDate=2013-12-31

Station ID from:

https://mesonet1.agron.iastate.edu/sites/site.php?network=NCDC81&station=USW00014819

In [56]:
df_daily = pd.read_csv('daily_chicago_2013.csv', parse_dates=['DATE'])
df_daily

,STATION,DATE,ACMC,ACMH,ACSC,ACSH,AWDR,AWND,DAEV,DAPR,...,WT22,WV01,WV03,WV07,WV18,WV20,alt,station_info,station_name,time
0,USW00014819,2013-01-01,NaN,NaN,NaN,NaN,NaN,36,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,USW00014819,2013-01-02,NaN,NaN,NaN,NaN,NaN,40,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,USW00014819,2013-01-03,NaN,NaN,NaN,NaN,NaN,50,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,USW00014819,2013-01-04,NaN,NaN,NaN,NaN,NaN,62,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,USW00014819,2013-01-05,NaN,NaN,NaN,NaN,NaN,45,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
360,USW00014819,2013-12-27,NaN,NaN,NaN,NaN,NaN,43,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
361,USW00014819,2013-12-28,NaN,NaN,NaN,NaN,NaN,54,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
362,USW00014819,2013-12-29,NaN,NaN,NaN,NaN,NaN,56,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
363,USW00014819,2013-12-30,NaN,NaN,NaN,NaN,NaN,31,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
364,USW00014819,2013-12-31,NaN,NaN,NaN,NaN,NaN,32,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [57]:
## Drop all columns with only NaN values
df_daily.dropna(axis=1, how='all', inplace = True)
df_daily.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 16 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   STATION  365 non-null    object
 1   DATE     365 non-null    datetime64[ns]
 2   AWND     365 non-null    int64
 3   PGTM     365 non-null    int64
 4   PRCP     365 non-null    int64
 5   TMAX     365 non-null    int64
 6   TMIN     365 non-null    int64
 7   WDF2     365 non-null    int64
 8   WDF5     365 non-null    int64
 9   WSF2     365 non-null    int64
 10  WSF5     365 non-null    int64
 11  WT01     142 non-null    float64
 12  WT02     9 non-null      float64
 13  WT03     45 non-null     float64
 14  WT05     1 non-null      float64
 15  WT08     96 non-null     float64
dtypes: datetime64[ns](1), float64(5), int64(9), object(1)
memory usage: 45.8+ KB

Information about different acronyms:
https://docs.opendata.aws/noaa-ghcn-pds/readme.html

AWND = Average daily wind speed (tenths of meters per second)

PGTM = Peak gust time (hours and minutes, i.e., HHMM)

PRCP = Precipitation (tenths of mm)

TMAX = Maximum temperature (tenths of degrees C)

TMIN = Minimum temperature (tenths of degrees C)

WDF2 = Direction of fastest 2-minute wind (degrees)

WDF5 = Direction of fastest 5-second wind (degrees)


WT** = Weather Type where ** has one of the following values:

01 = Fog, ice fog, or freezing fog (may include heavy fog)

02 = Heavy fog or heaving freezing fog (not always distinguished from fog)

03 = Thunder

04 = Ice pellets, sleet, snow pellets, or small hail

08 = Smoke or haze

In [58]:
df_daily.describe()

,AWND,PGTM,PRCP,TMAX,TMIN,WDF2,WDF5,WSF2,WSF5,WT01,WT02,WT03,WT05,WT08
count,365.000000,365.000000,365.000000,365.000000,365.000000,365.000000,365.000000,365.000000,365.000000,142.0,9.0,45.0,1.0,96.0
mean,42.915068,1361.005479,24.202740,148.586301,57.578082,192.136986,194.219178,89.767123,118.753425,1.0,1.0,1.0,1.0,1.0
std,15.152736,575.893024,70.714699,120.280448,110.623173,102.192088,101.170383,26.336955,35.763640,0.0,0.0,0.0,NaN,0.0
min,8.000000,1.000000,0.000000,-110.000000,-193.000000,10.000000,10.000000,31.000000,58.000000,1.0,1.0,1.0,1.0,1.0
25%,32.000000,1117.000000,0.000000,44.000000,-27.000000,90.000000,100.000000,72.000000,94.000000,1.0,1.0,1.0,1.0,1.0
50%,41.000000,1413.000000,0.000000,156.000000,56.000000,210.000000,200.000000,89.000000,112.000000,1.0,1.0,1.0,1.0,1.0
75%,52.000000,1710.000000,8.000000,250.000000,161.000000,270.000000,280.000000,103.000000,139.000000,1.0,1.0,1.0,1.0,1.0
max,103.000000,2359.000000,559.000000,361.000000,261.000000,360.000000,360.000000,210.000000,300.000000,1.0,1.0,1.0,1.0,1.0

In [59]:
df_daily.max()

STATION            USW00014819
DATE       2013-12-31 00:00:00
AWND                       103
PGTM                      2359
PRCP                       559
TMAX                       361
TMIN                       261
WDF2                       360
WDF5                       360
WSF2                       210
WSF5                       300
WT01                       1.0
WT02                       1.0
WT03                       1.0
WT05                       1.0
WT08                       1.0
dtype: object

In [60]:
df_daily.head()

,STATION,DATE,AWND,PGTM,PRCP,TMAX,TMIN,WDF2,WDF5,WSF2,WSF5,WT01,WT02,WT03,WT05,WT08
0,USW00014819,2013-01-01,36,1836,0,-27,-105,350,300,63,72,NaN,NaN,NaN,NaN,NaN
1,USW00014819,2013-01-02,40,1318,0,-10,-116,210,160,67,107,NaN,NaN,NaN,NaN,NaN
2,USW00014819,2013-01-03,50,1038,0,-10,-71,260,310,72,98,NaN,NaN,NaN,NaN,1.0
3,USW00014819,2013-01-04,62,1445,0,28,-99,240,250,107,139,NaN,NaN,NaN,NaN,NaN
4,USW00014819,2013-01-05,45,1945,3,39,-49,220,200,89,116,1.0,NaN,NaN,NaN,NaN